#+STARTUP: indent contents
#+OPTIONS: num:nil toc:nil
** Part 2
All of the opcode function -> number mappings can be discovered easily
enough with the function below.
#+NAME: tally-codes
#+BEGIN_SRC lisp :results silent
  (defun tally-codes (to-test)
    (let ((predicates (list #'addr #'addi #'mulr #'muli
                            #'banr #'bani #'borr #'bori
                            #'setr #'seti #'gtir #'gtri
                            #'gtrr #'eqir #'eqri #'eqrr))
          (mapping (make-hash-table)))
      (iter (for p in predicates)
            (let ((opcodes (iter (for (pre command post) in to-test)
                                 (when (equalp (funcall p (copy-seq pre) command) post)
                                   (collect (aref command 0))))))
              (setf (gethash p mapping) (remove-duplicates opcodes))))
      mapping))
  (tally-codes (car *input*))
#+END_SRC

#+BEGIN_SRC lisp :exports both :results output
  (iter (for (k v) in-hashtable (tally-codes (car *input*)))
                     (format t "~a: ~a~%" k v))
#+END_SRC

#+RESULTS:
#+begin_example
#<FUNCTION ADDR>: (4 13 7)
#<FUNCTION ADDI>: (10 4 13)
#<FUNCTION MULR>: (10 14 5 4 13 7)
#<FUNCTION MULI>: (5 4 13 7)
#<FUNCTION BANR>: (0 14 5 15 4 6 7)
#<FUNCTION BANI>: (14 5 15 4 6 7)
#<FUNCTION BORR>: (4 7)
#<FUNCTION BORI>: (4)
#<FUNCTION SETR>: (5 4 7 2)
#<FUNCTION SETI>: (10 14 5 15 4 7)
#<FUNCTION GTIR>: (8 0 14 5 15 4 6 7 2)
#<FUNCTION GTRI>: (8 0 12 14 5 15 4 1 6 7 11)
#<FUNCTION GTRR>: (8 9 0 12 5 15 4 3 6 7 11)
#<FUNCTION EQIR>: (8 0 12 5 15 1 3 6 11)
#<FUNCTION EQRI>: (8 0 12 14 5 15 6 7)
#<FUNCTION EQRR>: (8 0 14 5 15 1 6)
#+end_example

So it's obvious that BORI = 4, BORR = 7, and so on. I'm going to write
a quick routine to iterate over this until every function has only one
opcode.

#+NAME: get-opcodes
#+BEGIN_SRC lisp :exports both :results output
  (defun get-opcodes (to-test)
    (let ((tally (tally-codes to-test))
          (result (make-hash-table)))
      (iter (until (iter (for (k v) in-hashtable tally)
                         (always (= 1 (length v)))))
            (iter (for (k v) in-hashtable tally)
                  (when (= 1 (length v))
                    (iter (for (k0 v0) in-hashtable tally)
                          (unless (equal k k0)
                            (setf (gethash k0 tally) (remove (car v) v0)))))))
      (iter (for (k v) in-hashtable tally)
            (setf (gethash (car v) result) k))
      result))
#+END_SRC

#+RESULTS: get-opcodes
#+begin_example
#<FUNCTION ADDR>: (13)
#<FUNCTION ADDI>: (10)
#<FUNCTION MULR>: (14)
#<FUNCTION MULI>: (5)
#<FUNCTION BANR>: (0)
#<FUNCTION BANI>: (6)
#<FUNCTION BORR>: (7)
#<FUNCTION BORI>: (4)
#<FUNCTION SETR>: (2)
#<FUNCTION SETI>: (15)
#<FUNCTION GTIR>: (8)
#<FUNCTION GTRI>: (11)
#<FUNCTION GTRR>: (9)
#<FUNCTION EQIR>: (3)
#<FUNCTION EQRI>: (12)
#<FUNCTION EQRR>: (1)
#+end_example

#+NAME: solve-b
#+BEGIN_SRC lisp :results silent
  (defun solve-b (to-test to-run)
    (let ((codes (get-opcodes to-test))
          (registers (make-array 4 :initial-element 0)))
      (iter (for command in to-run)
            (funcall (gethash (aref command 0) codes)
                     registers
                     command))
      registers))
#+END_SRC

#+NAME: problem-b
#+BEGIN_SRC lisp :noweb yes :results silent
  (defun problem-b () (format t "Problem 16 B: ~a~%" (solve-b (car *input*) (cadr *input*))))
#+END_SRC
